[
    {
      "word": "hone",
      "pronunciation": "həʊn",
      "meaning": "to make an object sharp",
      "sentence1": "His physique was honed to perfection.",
      "sentence2": "The bone had been honed to a point."
    },
    {
      "word": "misguided",
      "pronunciation": "ˌmɪsˈɡaɪ.dɪd",
      "meaning": "unreasonable or unsuitable because of being based on bad judgment or on wrong information or beliefs",
      "sentence1": "He was shot as he made a misguided attempt to stop the robbers single-handed.",
      "wordsentence2": "The company blamed its disappointing performance on a misguided business plan."
    },
    {
      "word": "virtuoso",
      "pronunciation": "ˌvɜː.tʃuˈəʊ.səʊ",
      "meaning": "a person who is extremely skilled at something, especially at playing an instrument or performing",
      "sentence1": "The world’s greatest tenor treated us to a virtuoso display of his abundant talent.",
      "sentence2": "Famous mainly for his wonderful voice, Cole was also a virtuoso on the piano."
    },
    {
      "word": "omit",
      "pronunciation": "əʊˈmɪt",
      "meaning": "to fail to include or do something",
      "sentence1": "She omitted to mention that she would be away next week.",
      "sentence2": "I’d be upset if my name were omitted from the list of contributors."
    },
    {
      "word": "isle",
      "pronunciation": "aɪl",
      "meaning": "(used especially in place names) an island",
      "sentence1": "The Isle of Skye.",
      "sentence2": "Explore now the more remote Caribbean isles!"
    },
    {
      "word": "mnemonic",
      "pronunciation": "nɪˈmɒn.ɪk",
      "meaning": "something such as a very short poem or a special word used to help a person remember something",
      "sentence1": "I think music has a tremendous mnemonic power.",
      "sentence2": "Rhyme's mnemonic qualities are part of understanding its effects."
    },
    {
      "word": "bypass",
      "pronunciation": "ˈbaɪ.pɑːs",
      "meaning": "to avoid something by going around it; to ignore a rule",
      "sentence1": "The oil pipeline bypasses the protected wilderness area.",
      "sentence2": "They bypassed the committee and went straight to senior management."
    },
    {
      "word": "misconstrue",
      "pronunciation": "ˌmɪs.kənˈstruː",
      "meaning": "to form a false understanding of the meaning or intention of something that someone does or says",
      "sentence1": "She said Harris had misconstrued her comments.",
      "sentence2": "Their caution was misconstrued as cowardice."
    },
    {
      "word": "abate",
      "pronunciation": "əˈbeɪt",
      "meaning": "to become less intense or severe; to make something less intense or severe",
      "sentence1": "With bated breath we waited for the storm to pass but during the entire night it didn't show signs of abating.",
      "sentence2": "They waited for the crowd’s fury to abate."
    },
    {
      "word": "pivotal",
      "pronunciation": "ˈpɪv.ə.təl",
      "meaning": "central and important",
      "sentence1": "He plays a pivotal figure/role in the story.",
      "sentence2": "She played a pivotal role in the civil rights movement."
    },
    {
      "word": "skewed",
      "pronunciation": "skjuːd",
      "meaning": "not accurate or exact",
      "sentence1": "Maybe your world view is a little skewed, flat earther!",
      "sentence2": "Her smile often is slightly skewed."
    },
    {
      "word": "reprimand",
      "pronunciation": "ˈrep.rɪ.mɑːnd",
      "meaning": "to express to someone your strong official disapproval of them",
      "sentence1": "Her boss gave her a severe reprimand for being late.",
      "sentence2": "He was reprimanded by her teacher for biting another girl."
    },
    {
      "word": "denominator",
      "pronunciation": "dɪˈnɒm.ɪ.neɪ.tər",
      "meaning": "the number below the line in a fraction",
      "sentence1": "In the fraction ¾, 4 is the denominator.",
      "sentence2": "A number of chapters in the volume do not support that common denominator."
    },
    {
      "word": "rupture",
      "pronunciation": "ˈrʌp.tʃər",
      "meaning": "to (cause something to) explode, break, or tear",
      "sentence1": "This news has ruptured (= violently ended) the delicate peace between the rival groups.",
      "sentence2": "a rupture of the pipeline."
    },
    {
      "word": "comestibles",
      "pronunciation": "kəˈmes.tə.bəlz",
      "meaning": "things that are for eating",
      "sentence1": "We have brought back some fascinating new comestibles.",
      "sentence2": "She bought comestibles and a couple of other things from the store."
    },
    {
      "word": "inaugural",
      "pronunciation": "ɪˈnɔː.ɡjə.rəl",
      "meaning": "an inaugural event is the first in a series of planned events",
      "sentence1": "He plans to be on the inaugural flight when the twinjet aircraft goes into service next month.",
      "sentence2": "He held an inaugural ceremony last Saturday."
    },
    {
      "word": "harbinger",
      "pronunciation": "ˈhɑːbɪndʒə(r)",
      "meaning": "a person or thing that shows that sth is going to happen soon, especially sth bad",
      "sentence1": "A more disruptive factor lies with the warming of the oceans, a probable harbinger of the greenhouse effect.",
      "sentence2": "That's certainly not a harbinger of doom!"
    },
    {
      "word": "belabor",
      "pronunciation": "bɪˈleɪ.bɚ",
      "meaning": "to explain something more than necessary",
      "sentence1": "There's no need to belabor the point.",
      "sentence2": "I don’t want to belabor the point, but it’s vital you understand how important this is."
    },
    {
      "word": "leash",
      "pronunciation": "liːʃ",
      "meaning": "a piece of rope, chain, etc. tied to an animal, especially to a dog at its collar when taking it for a walk",
      "sentence1": "Please keep your dog on a leash when on the beach.",
      "sentence2": "Dogs must be kept on a leash in this park."
    },
    {
      "word": "whet",
      "pronunciation": "wet",
      "meaning": "to increase someone's interest in and wish for something, usually by giving them a small experience of it",
      "sentence1": "This will whet your appetite for more.",
      "sentence2": "That one kiss had whetted his appetite."
    },
    {
      "word": "buldgeon",
      "pronunciation": "ˈblʌdʒ.ən",
      "meaning": "to force someone to do something",
      "sentence1": "The managers bludgeoned us into agreeing to the changes.",
      "sentence2": "A heavy stick that is thick at one end and which can be used as a weapon is called a buldgeon."
    },
    {
      "word": "pilfer",
      "pronunciation": "ˈpɪl.fər",
      "meaning": "to steal things of small value or to steal money, ideas, information, etc. from an organization",
      "sentence1": "He was caught pilfering (sweets) from the shop.",
      "sentence2": "They were charged with conspiracy to pilfer $600m from a major international conglomerate."
    },
    {
      "word": "bygone",
      "pronunciation": "ˈbaɪ.ɡɒn",
      "meaning": "belonging to or happening in a past time",
      "sentence1": "The empty factories are relics of a bygone era.",
      "sentence2": "Just let bygones be bygones and be friends again."
    },
    {
      "word": "propagate",
      "pronunciation": "ˈprɒp.ə.ɡeɪt",
      "meaning": "to spread opinions, lies, or beliefs among a lot of people",
      "sentence1": "Such lies are propagated in the media.",
      "sentence2": "Light and sound propagate at vastly different speeds."
    },
    {
      "word": "procurement",
      "pronunciation": "prəˈkjʊə.mən",
      "meaning": "the process of getting supplies; the process by which an organization buys the products or services from other organizations",
      "sentence1": "He vows to cut procurement costs 10% by halving the number of global suppliers.",
      "sentence2": "We must ensure that the process follows strict procurment rules."
    },
    {
      "word": "succulent",
      "pronunciation": "ˈsʌk.jə.lən",
      "meaning": "pleasantly juicy",
      "sentence1": "Succulent food is juicy and delicious.",
      "sentence2": "The sirloin is a quality piece of meat, tender and succulent."
    },
    {
      "word": "boulder",
      "pronunciation": "ˈbəʊl.dər",
      "meaning": "a very large rock",
      "sentence1": "The earlier parts of the castle constructions are characterised by heavy granite boulder constructions.",
      "sentence2": "His adventurous-spirited mother loved skiing, hiking, and bouldering."
    }
]